import pig from '../../img/screenshot/pig.jpg';
import $921 from '../../img/screenshot/9-21.jpg';
import $1030 from '../../img/screenshot/10-30.jpg';
import $1109 from '../../img/screenshot/11-9.jpg';
import $1026 from '../../img/screenshot/10-26.jpg';
import $1203 from '../../img/screenshot/12-03.jpg';
import $1207 from '../../img/screenshot/12-07.jpg';
import $1208 from '../../img/screenshot/12-08.jpg';
import cake from '../../img/cake.jpg';
export default [
  {
    text: {
      title: '这一年你听的最多的一首歌, 不用去猜. 可能它的歌词对你很有意义吧',
      subtitle: ' 网易云音乐'
    }
  },
  {
    text: {
      title: '三月份, 你开启了你的前端之路, 写出了第一行 JS 的代码',
      subtitle: `You don't know js`
    }
  },
  {
    text: {
      title: '暑假, 你去了厦门, 去了大理, 还去了成都.',
      subtitle: '环游世界'
    }
  },
  {
    text: {
      title: '九月份, 你终于能够一个人作出一张网页了!!',
      subtitle: 'Bootstrap & Freecodecamp'
    }
  },
  {
    text: {
      title: '十月份, 你拥有了第一只宠物, 从此你们形影不离',
      subtitle: 'MUSA'
    }
  },
  {
    img: {
      pic: $921,
      content:
        '我们花了一个小时希望能否翻墙, 可是最后还是失败了. 不是我蠢也不是你笨, 只是体制问题. ',
      datetime: '2017/9/21'
    }
  },
  {
    img: {
      pic: $1026,
      content: '这天很特别, 你化成蝴蝶 🦋 飞走了',
      datetime: '2017/10/25'
    }
  },
  {
    img: {
      pic: $1030,
      content:
        '可能是因为你没理我, 可能是我第一次上班还有很多不习惯, 突然说了一些我现在都觉得很奇怪的话',
      datetime: '2017/10/30'
    }
  },
  {
    img: {
      pic: $1109,
      content: '这天你告诉我, 你要打比赛!!! 真的很开心, 你终于开始了...',
      datetime: '2017/11/9'
    }
  },
  {
    img: {
      pic: $1203,
      content: '没想到两个月的时间, musa 已经这么胖了',
      datetime: '2017/12/3'
    }
  },
  {
    img: {
      pic: $1207,
      content: '没有通宵写过代码的人, 不是真正的仙女🧝🏻‍♀️',
      datetime: '2017/12/7'
    }
  },
  {
    img: {
      pic: $1208,
      content:
        '看到你老是被室友伤害真的有点难过啊. 这也让我更像帮助你成为一个程序媛!',
      datetime: '2017/12/8'
    }
  },
  {
    img: {
      pic: pig,
      content:
        '从 9 月份到现在, 你至少说过我 30 次 🐷🐷🐷, 可能我真的是一个不了解女孩的 🐷 吧'
    }
  },
  {
    text: {
      title:
        '因为我对行业也是在不断的认识中, 所以也会不断地改变自己想法. 你应该忠于自己的想法, 但是也别太生我的气',
      subtitle: '不要告白'
    }
  }, {
    img: {
      pic: cake,
      content: '20 岁是个很特别的生日, 不是奔三,  而是决定一生的十年的开始. 你要抓住这个机会, 加油啊!!另外, 生日快乐!!'
    }
  }
];
